<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use Mpdf\Mpdf;
use DateTime;
use Carbon\Carbon;

class PDFKPIController extends Controller
{
    public function pdf_gen(){
        $config = include(config_path('configPDF_V.php'));       // ดึงการตั้งค่าฟอนต์จาก config
        $mpdf = new Mpdf($config);
        $mpdf->SetY(60);

        $stylesheet = "
        <style>
            table {
                border-collapse: collapse;
                width: 100%;
                margin-bottom: 7px;

            }
            table, th, td {
                border: 1px solid black;
                font-size: 16pt;
            }
            th, td {
                padding: 8px;
                text-align: center;
                font-size: 16pt;
            }
            tr, td {
                padding: 8px;
                text-align: center;
                font-size: 16pt;
            }
            .highlight {
                background-color: yellow;
            }

            .justified-text {
                text-align: justify;
                line-height: 1.5; /* กำหนดระยะห่างบรรทัดให้ดูอ่านง่าย */
                font-size: 14px; /* ขนาดตัวอักษร */
            }

        </style>";

        // logo kmutnb
        $htmlContent = '
            <div style="text-align: center; margin-bottom: 20px;">
                <img src="' . public_path('images/logo_kmutnb.png') . '" style="width: 60px; height: auto;">
            </div>
        ';

        $htmlContent .= '
            <p style="text-align: center;">
                <b>แบบประเมินโครงการที่ตอบสนองยุทธศาสตร์การพัฒนาสำนักคอมพิวเตอร์และเทคโนโลนีสารสนเทศ</b><br>
                <b>ประจำปีงบประมาณ</b><br>
            </p>
            
        ';

        $htmlContent .= '
            <b>คำชี้แจง</b><br>
        ';

        $htmlContent .= '
            <b>1. ชื่อโครงการ / กิจกรรม : </b><br>
        ';

        $htmlContent .= '
            <b>2. โครงการ / กิจกรรมนี้ตอบสนองแผนยุทธศาสตร์การพัฒนาสำนักคอมพิวเตอร์และเทคโนโลยีสารสนเทศ พ.ศ. </b><br>
        ';

        $htmlContent .= '
            <b>3. ส่วนงานที่รับผิดชอบ : </b><br>
        ';

        $htmlContent .= '
            <b>4. วิธีการดำเนินโครงการ : </b><br>
        ';

        $htmlContent .= '
            <b>5. ระยะเวลาในการดำเนินงาน : </b><br>
        ';

        $htmlContent .= '
            <b>6. วัตถุประสงค์</b><br>
        ';

        $htmlContent .= '
            <b>7. ผลการดำเนินงาน</b><br>
        ';

        $htmlContent .= '
            <b>8. ผลการดำเนินงานตามตัวชี้วัด (KPIs)</b><br>
        ';

        $htmlContent .= '
            <b>9. งบประมาณที่ใช้ดำเนินการ</b><br>
        ';

        $htmlContent .= '
            <b>10. ประโยนช์ที่ได้รับจากการดำเนินโครงการ (หลังการจัดการโครงการ)</b><br>
        ';

        $htmlContent .= '
            <b>11. ปัญหาและอุปสรรคในการดำเนินงานโครงการ</b><br>
            .........................................................................................................................................................................................<br>
            .........................................................................................................................................................................................<br>
            .........................................................................................................................................................................................<br>
            .........................................................................................................................................................................................<br>
        ';

        $htmlContent .= '
            <b>12. แนวทางการดำเนินการแก้ไข / ข้อเสนอแนะ</b><br>
            .........................................................................................................................................................................................<br>
            .........................................................................................................................................................................................<br>
            .........................................................................................................................................................................................<br>
            .........................................................................................................................................................................................<br>
        ';

        $htmlContent .= '
            <br><br><br><br>
            <div>
                <div style="width: 300px; text-align: center; float: left;">
                    ลงชื่อ ................................................. <br>
                    (               ) <br>
                    ผู้รับผิดชอบโครงการ <br>
                    วันที่ ........../......................./..........
                </div>
                <div style="width: 300px; text-align: center; float: right;">
                    ลงชื่อ ................................................. <br>
                    (               ) <br>
                    ผู้อำนวยการ <br>
                    วันที่ ........../......................./..........
                </div>
            </div>

            
        ';
        


        $mpdf->WriteHTML($stylesheet, 1);              // โหลด CSS  
        $mpdf->WriteHTML($htmlContent, 2);             // เขียนเนื้อหา HTML ลงใน PDF

        $mpdf->SetTitle('แบบประเมินโครงการที่ตอบสนองยุทธศาสตร์การพัฒนาสำนักคอมพิวเตอร์และเทคโนโลยีสารสนเทศประจำปีงบประมาณ');
        return $mpdf->Output('แบบประเมินโครงการที่ตอบสนองยุทธศาสตร์การพัฒนาสำนักคอมพิวเตอร์และเทคโนโลยีสารสนเทศประจำปีงบประมาณ.pdf', 'I');       // ส่งไฟล์ PDF กลับไปให้ผู้ใช้
    }
}
